pre simplify unity schemas
